## Таблица-3
Дано натуральное число n (n≤ 9). Напишите программу, которая печатает таблицу сложения для всех чисел от 1 до n в соответствии с примером.

Формат входных данных
На вход программе подается одно натуральное число.

Формат выходных данных
Программа должна вывести таблицу сложения для всех чисел от 1 доn.

Примечание. В конце строки может быть пробел.

```python
n = int(input())
for i in range (n):
    for j in range(9):
        print(f"{i + 1} + {j + 1} = {i + j + 2}")
    print()
```