## Звездный треугольник 🌶️🌶️
Дано нечетное натуральное число n. Напишите программу, которая печатает равнобедренный звездный треугольник с основанием, равным n в соответствии с примером:

```
*
**
***
****
***
**
*
```

Формат входных данных
На вход программе подается одно нечетное натуральное число.

Формат выходных данных
Программа должна вывести треугольник в соответствии с условием.

Примечание. Используйте вложенный цикл for.

```python
n = (int(input())) // 2 + 1
for i in range(n):
    print("*" * (i + 1))
for i in range(n):
    n -= 1
    print("*" * n)
```