## Сумма факториалов
Дано натуральное число n. Напишите программу, которая выводит значение суммы 1!+2!+3!+…+n!.

Формат входных данных
На вход программе подается одно натуральное число.

Формат выходных данных
Программа должна вывести значение суммы 1!+2!+3!+…+n!.

Примечание 1. Факториалом натурального числа n, называется произведение всех натуральных чисел от 1 до n, то естьn!=1⋅2⋅3⋅…⋅n

Примечание 2. Задачу можно решить без вложенного цикла. Напишите две версии программы =)

```python
n = int(input())
sum = 0
fact = 1

for i in range(1, n + 1):
    fact *= i
    sum += fact
    
    
print(sum)

```