## Простые числа

На вход программе подается два натуральных числа a и b (a< b). Напишите программу, которая находит все простые числа от a до b включительно.

Формат входных данных
На вход программе подаются два числа, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести все простые числа от a до b включительно, каждое на отдельной строке.

Примечание. Число 1 простым не является.

```python
a, b = int(input()), int(input())

for i in range(a, b + 1): # обходим все числа от a до b
    is_prime = True # флаг, указывающий, является ли число простым
    
    for j in range(2, i): # проверяем, делится ли число на какое-либо другое число кроме 1 и самого себя
        if i % j == 0:
            is_prime = False
            break
    
    if is_prime and i > 1: # если число простое, выводим его на экран
        print(i)
```