## Асимптотическое приближение
На вход программе подается натуральное число n.  

Напишите программу, которая вычисляет значение выражения (1+1/2+1/3+....1/n)-log(n)

Примечание. Для вычисления натурального логарифма воспользуйтесь функцией log(n), которая находится в модуле math.

```python
n = int(input())
total= 0
from math import log
for i in range(1,n+1):
    total= total + 1/i
print(total- log(n))
```