## Количество пятерок
На вход программе подается последовательность целых чисел от 1 до 5, характеризующее оценку ученика, каждое число на отдельной строке. Концом последовательности является любое отрицательное число, либо число большее 5. Напишите программу, которая выводит количество пятерок.

Формат входных данных
На вход программе подается последовательность чисел, каждое число на отдельной строке.

Формат выходных данных
Программа должна вывести количество пятерок.

```python
num = int(input())
num5 = 0
while 0 < num < 6:
    # print(num)
    if num < 6 and num > 4:
        # print("    ", num5)
        num5 += 1
    num = int(input())
    
print(num5)

```