## Обратный порядок 1
Дано натуральное число. Напишите программу, которая выводит его цифры в столбик в обратном порядке.

Формат входных данных 
На вход программе подается одно натуральное число.

Формат выходных данных
Программа должна вывести цифры введенного числа в столбик в обратном порядке.

```python
while n != 0: # пока n не равно 0:
    lastdigit = n % 10 # получаем последнюю цифру
    print(lastdigit) # печатаем последнюю цифру числа
    n = n // 10 # удаляем последнюю цифру
```