## Обратный порядок 2
Дано натуральное число. Напишите программу, которая меняет порядок цифр числа на обратный.

Формат входных данных 
На вход программе подается одно натуральное число.

Формат выходных данных
Программа должна вывести число, записанное в обратном порядке.

```python
while n != 0:
    lastdigit = n % 10
    print(lastdigit, end = "")
    n = n // 10
```