## max и min
Дано натуральное число n,(n≥10). Напишите программу, которая определяет его максимальную и минимальную цифры.

Формат входных данных 
На вход программе подается одно натуральное число.

Формат выходных данных
Программа должна вывести максимальную и минимальную цифры введенного числа (с поясняющей надписью).

```python
n = int(input())
max = n % 10
min = n % 10
while n != 0:
    lastdigit = n % 10
    # print("lastdigit", lastdigit)
    if lastdigit >= max:
        max = lastdigit
        # print("max", max)
    elif lastdigit < min:
        min = lastdigit
        # print("min", min)
    n = n // 10
print("Максимальная цифра равна", max) 
print("Минимальная цифра равна", min)
```