## Все вместе
Дано натуральное число.  
Напишите программу, которая вычисляет:

сумму его цифр;  
количество цифр в нем;  
произведение его цифр;  
среднее арифметическое его цифр;  
его первую цифру;  
сумму его первой и последней цифры.  

Формат входных данных  
На вход программе подается одно натуральное число.

Формат выходных данных  
Программа должна вывести значения указанных величин в указанном порядке.

```python
n = int(input())
num = n # введенное полностью число

summa = 0 # сумма цифр
count = 0 # количество цифр
product = 1 # произведение цифр

while n != 0:
    lastdigit = n % 10
    summa += lastdigit
    count += 1
    product *= lastdigit
    n = n // 10
    
print(summa)
print(count)
print(product)
print(summa / count)
print(lastdigit)
print(lastdigit + num % 10)
```