## Вторая цифра
Дано натуральное число n(n>9). Напишите программу, которая определяет его вторую (с начала) цифру.

Формат входных данных 
На вход программе подается одно натуральное число, состоящее как минимум из двух цифр.

Формат выходных данных
Программа должна вывести его вторую (с начала) цифру.

```python
n = int(input())
num = ''
while n != 0:
    lastdigit = n % 10
    n = n // 10
    num += str(lastdigit)
    second = (int(num) % 100) // 10
print(second)
```