## Одинаковые цифры
Дано натуральное число. Напишите программу, которая определяет, состоит ли указанное число из одинаковых цифр.

Формат входных данных 
На вход программе подается одно натуральное число.

Формат выходных данных
Программа должна вывести «YES» если число состоит из одинаковых цифр и «NO» в противном случае.

```python
n = int(input())
flag = False
count = 0
while n > 9:
    lastdigit = n % 10
    secondigit = (n % 100) // 10
    # print(n, lastdigit, secondigit, count)
    n = n // 10
    if lastdigit != secondigit:
        # count +=1
        flag = True
    
if flag == True:
    print("NO")
else:
    print("YES")
```